![](logo.png)
## Day Objectives

# Pandas
- Pandas is a built in library using for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc.
- Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs.
- There are two main data structures in Pandas - Series and Dataframes. The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis.
- Source: https://pandas.pydata.org/pandas-docs/stable/overview.html

In [1]:
import pandas as pd

# Pandas Series
- we can create series by using
    - list
    - tuples
    - dict
    - numpy
    - date range

In [2]:
pd.__version__

'1.0.5'

In [3]:
# Pandas Series using List
li = [2,3,45,56,56]
s1 = pd.Series(li)
s1

0     2
1     3
2    45
3    56
4    56
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

In [5]:
# using tuple
t = (2,2.3,4.56,"apssdc")
s2 = pd.Series(t)
s2

0         2
1       2.3
2      4.56
3    apssdc
dtype: object

In [6]:
# using Dict
di = {"Name":"Swathi","Pin":"0006","College":"BVC"}
s3 = pd.Series(di)
s3

Name       Swathi
Pin          0006
College       BVC
dtype: object

In [9]:
# using numpy
import numpy as np
n1 = np.array([12,3,4.5,"SDC"])
print(n1)
s4 = pd.Series(n1)
s4

['12' '3' '4.5' 'SDC']

0     12
1      3
2    4.5
3    SDC
dtype: object

In [11]:
# re-indexing
s4.index = ["a",23,2.34,"d"]
s4

a        12
23        3
2.34    4.5
d       SDC
dtype: object

## Slicing & Indexing

- Indexing : Accessing Particular Element
- Slicing  : accessing Sub data or some data of given range

In [14]:
s4.index

Index(['a', 23, 2.34, 'd'], dtype='object')

In [15]:
s4["a"]

'12'

In [16]:
s3

Name       Swathi
Pin          0006
College       BVC
dtype: object

In [17]:
s3["Name"]

'Swathi'

In [18]:
s3["Pin"]

'0006'

In [19]:
s1

0     2
1     3
2    45
3    56
4    56
dtype: int64

In [20]:
s1[0]

2

In [21]:
s1[3]

56

In [22]:
s1

0     2
1     3
2    45
3    56
4    56
dtype: int64

In [23]:
s1[0::2]

0     2
2    45
4    56
dtype: int64

In [24]:
s1[1::2]

1     3
3    56
dtype: int64

In [25]:
s1[1:3] # 3 index exclusive

1     3
2    45
dtype: int64

In [26]:
s1[3:]

3    56
4    56
dtype: int64

In [27]:
# Fancy Slicing
s1[[1,3,2]]

1     3
3    56
2    45
dtype: int64

In [28]:
s5 = pd.date_range(start = "2021-06-29", end = "2021-07-17")
s5

DatetimeIndex(['2021-06-29', '2021-06-30', '2021-07-01', '2021-07-02',
               '2021-07-03', '2021-07-04', '2021-07-05', '2021-07-06',
               '2021-07-07', '2021-07-08', '2021-07-09', '2021-07-10',
               '2021-07-11', '2021-07-12', '2021-07-13', '2021-07-14',
               '2021-07-15', '2021-07-16', '2021-07-17'],
              dtype='datetime64[ns]', freq='D')

In [31]:
s1.index = ["a","b","c"]

ValueError: Length mismatch: Expected axis has 5 elements, new values have 3 elements

```Note``` 
 **the Number of elements in the Index list is always equal to the number of
elements in the specified series.**

## Task
- Create one Pandas Series having 1 to 10 index and  values are squares of the index value
1 - 1
2 - 4
3 - 9
4 - 16
5 - 25
.
.
10 - 100

# Pandas DataFrame

In [32]:
# creating pandas df using List
li = [[1,2,3,34,4,5],[2,3,4,5,6,7]]
df1 = pd.DataFrame(li)
df1
# always column and row index values start from 0

   0  1  2   3  4  5
0  1  2  3  34  4  5
1  2  3  4   5  6  7

In [33]:
df1.shape # rows,columns

(2, 6)

In [35]:
t = ((1,2,3),(4,5,6))
df2 = pd.DataFrame(t, columns = ["A","B","C"])
df2

   A  B  C
0  1  2  3
1  4  5  6

In [36]:
df2.index = ["X","Y"]
df2

   A  B  C
X  1  2  3
Y  4  5  6

In [38]:
# using Dict
d1 = {
    "Name" : ["Teja","Swathi","Jahnavi","Chinnu", np.nan],
    "Branch" : ["CSe","ECE","CS","IT", "Civil"],
    "Gender" : ["Male","Female","Female","Female", np.nan]
}
df3 = pd.DataFrame(d1)
df3
# Nan - not a number

      Name Branch  Gender
0     Teja    CSe    Male
1   Swathi    ECE  Female
2  Jahnavi     CS  Female
3   Chinnu     IT  Female
4      NaN  Civil     NaN

In [39]:
df3.shape

(5, 3)

In [42]:
type(df3)

pandas.core.frame.DataFrame

In [43]:
df3.columns

Index(['Name', 'Branch', 'Gender'], dtype='object')

In [44]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [46]:
print(type(df3["Name"]))
df3["Name"] # it return pandas series

<class 'pandas.core.series.Series'>

0       Teja
1     Swathi
2    Jahnavi
3     Chinnu
4        NaN
Name: Name, dtype: object

In [48]:
df3[["Name","Branch"]] # sub df

      Name Branch
0     Teja    CSe
1   Swathi    ECE
2  Jahnavi     CS
3   Chinnu     IT
4      NaN  Civil

In [49]:
df3[0] # 2-D

KeyError: 0

In [51]:
df3[0:1] # accesinng a particular row

   Name Branch Gender
0  Teja    CSe   Male

In [52]:
df3[2:3]

      Name Branch  Gender
2  Jahnavi     CS  Female

In [53]:
df3[2:]

      Name Branch  Gender
2  Jahnavi     CS  Female
3   Chinnu     IT  Female
4      NaN  Civil     NaN

In [56]:
len(df3)

5

In [57]:
df3[3:4]

     Name Branch  Gender
3  Chinnu     IT  Female

# iloc -- for accessing rows using integer indicies
# loc -- for accessing rows other than integer indicies

In [59]:
df3.iloc[0]

Name      Teja
Branch     CSe
Gender    Male
Name: 0, dtype: object

In [60]:
df3.iloc[4]

Name        NaN
Branch    Civil
Gender      NaN
Name: 4, dtype: object

In [61]:
df3.iloc[2:4]

      Name Branch  Gender
2  Jahnavi     CS  Female
3   Chinnu     IT  Female

In [64]:
df3.loc[3, "Name"]

'Chinnu'

In [68]:
df3.loc[[3,2, 1],"Name"]

3     Chinnu
2    Jahnavi
1     Swathi
Name: Name, dtype: object

In [69]:
df3.loc[[1,4,2,3],["Name","Gender"]]

      Name  Gender
1   Swathi  Female
4      NaN     NaN
2  Jahnavi  Female
3   Chinnu  Female

# Indexing & Re-Indexing

In [70]:
df3.index = ["a","b","c","d","e"]
df3

      Name Branch  Gender
a     Teja    CSe    Male
b   Swathi    ECE  Female
c  Jahnavi     CS  Female
d   Chinnu     IT  Female
e      NaN  Civil     NaN

In [72]:
df3.loc["b"]

Name      Swathi
Branch       ECE
Gender    Female
Name: b, dtype: object

In [75]:
df3.set_index("Name", inplace = True)

In [76]:
df3

        Branch  Gender
Name
Teja       CSe    Male
Swathi     ECE  Female
Jahnavi     CS  Female
Chinnu      IT  Female
NaN      Civil     NaN

In [78]:
df3.loc["Teja"]

Branch     CSe
Gender    Male
Name: Teja, dtype: object

In [79]:
df3.loc["Jahnavi"]

Branch        CS
Gender    Female
Name: Jahnavi, dtype: object

In [82]:
df3.reset_index(inplace = True)

In [83]:
df3

      Name Branch  Gender
0     Teja    CSe    Male
1   Swathi    ECE  Female
2  Jahnavi     CS  Female
3   Chinnu     IT  Female
4      NaN  Civil     NaN

# Merging / Combining

In [84]:
df3

      Name Branch  Gender
0     Teja    CSe    Male
1   Swathi    ECE  Female
2  Jahnavi     CS  Female
3   Chinnu     IT  Female
4      NaN  Civil     NaN

In [85]:
d1 = {
    "Name" : ["Teja","Swathi","Jahnavi","Chinnu", np.nan],
    "Branch" : ["CSe","ECE","CS","IT", "Civil"],
    "PIN" : [567,654,456,456,np.nan]
}
df4 = pd.DataFrame(d1)
df4

      Name Branch    PIN
0     Teja    CSe  567.0
1   Swathi    ECE  654.0
2  Jahnavi     CS  456.0
3   Chinnu     IT  456.0
4      NaN  Civil    NaN

In [87]:
pd.concat([df3,df4],axis = 0) # concat the df at row 
# axis =0  rows
# axis = 1 columns

      Name Branch  Gender    PIN
0     Teja    CSe    Male    NaN
1   Swathi    ECE  Female    NaN
2  Jahnavi     CS  Female    NaN
3   Chinnu     IT  Female    NaN
4      NaN  Civil     NaN    NaN
0     Teja    CSe     NaN  567.0
1   Swathi    ECE     NaN  654.0
2  Jahnavi     CS     NaN  456.0
3   Chinnu     IT     NaN  456.0
4      NaN  Civil     NaN    NaN

In [88]:
pd.concat([df3,df4],axis = 1)

      Name Branch  Gender     Name Branch    PIN
0     Teja    CSe    Male     Teja    CSe  567.0
1   Swathi    ECE  Female   Swathi    ECE  654.0
2  Jahnavi     CS  Female  Jahnavi     CS  456.0
3   Chinnu     IT  Female   Chinnu     IT  456.0
4      NaN  Civil     NaN      NaN  Civil    NaN

In [89]:
df3.append(df4)

      Name Branch  Gender    PIN
0     Teja    CSe    Male    NaN
1   Swathi    ECE  Female    NaN
2  Jahnavi     CS  Female    NaN
3   Chinnu     IT  Female    NaN
4      NaN  Civil     NaN    NaN
0     Teja    CSe     NaN  567.0
1   Swathi    ECE     NaN  654.0
2  Jahnavi     CS     NaN  456.0
3   Chinnu     IT     NaN  456.0
4      NaN  Civil     NaN    NaN

In [90]:
df4.append(df3)

      Name Branch    PIN  Gender
0     Teja    CSe  567.0     NaN
1   Swathi    ECE  654.0     NaN
2  Jahnavi     CS  456.0     NaN
3   Chinnu     IT  456.0     NaN
4      NaN  Civil    NaN     NaN
0     Teja    CSe    NaN    Male
1   Swathi    ECE    NaN  Female
2  Jahnavi     CS    NaN  Female
3   Chinnu     IT    NaN  Female
4      NaN  Civil    NaN     NaN

In [91]:
pd.merge(df3,df4) # it return common data/ records from each df

      Name Branch  Gender    PIN
0     Teja    CSe    Male  567.0
1   Swathi    ECE  Female  654.0
2  Jahnavi     CS  Female  456.0
3   Chinnu     IT  Female  456.0
4      NaN  Civil     NaN    NaN

In [93]:
d1 = {
    "Name" : ["Teja","Swathi","Jahnavi"],
    "Branch" : ["CSe","ECE","CS"],
    "PIN" : [567,654,456]
}
df4 = pd.DataFrame(d1)
df4

      Name Branch  PIN
0     Teja    CSe  567
1   Swathi    ECE  654
2  Jahnavi     CS  456

In [94]:
df3

      Name Branch  Gender
0     Teja    CSe    Male
1   Swathi    ECE  Female
2  Jahnavi     CS  Female
3   Chinnu     IT  Female
4      NaN  Civil     NaN

In [95]:
pd.merge(df3,df4)

      Name Branch  Gender  PIN
0     Teja    CSe    Male  567
1   Swathi    ECE  Female  654
2  Jahnavi     CS  Female  456

In [100]:
pd.merge(df4,df3, how = "inner") # common data / intersection

      Name Branch  PIN  Gender
0     Teja    CSe  567    Male
1   Swathi    ECE  654  Female
2  Jahnavi     CS  456  Female

In [101]:
pd.merge(df4,df3, how = "outer") # all data /  union

      Name Branch    PIN  Gender
0     Teja    CSe  567.0    Male
1   Swathi    ECE  654.0  Female
2  Jahnavi     CS  456.0  Female
3   Chinnu     IT    NaN  Female
4      NaN  Civil    NaN     NaN

In [102]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how: str = 'inner', on=None, left_on=None, right_on=None, left_index: bool = False, right_index: bool = False, sort: bool = False, suffixes=('_x', '_y'), copy: bool = True, indicator: bool = False, validate=None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : tuple of (str, str), default ('_x', '_y')
        Suffix to apply to overlapping column names in the left and right
        side, respectively. To raise an exception on overlapping columns use
        (False, False).
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------

    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

In [103]:
pd.merge(df4,df3, how = "left") # df4

      Name Branch  PIN  Gender
0     Teja    CSe  567    Male
1   Swathi    ECE  654  Female
2  Jahnavi     CS  456  Female

In [104]:
df4

      Name Branch  PIN
0     Teja    CSe  567
1   Swathi    ECE  654
2  Jahnavi     CS  456

In [105]:
pd.merge(df4,df3, how = "right") # df3

      Name Branch    PIN  Gender
0     Teja    CSe  567.0    Male
1   Swathi    ECE  654.0  Female
2  Jahnavi     CS  456.0  Female
3   Chinnu     IT    NaN  Female
4      NaN  Civil    NaN     NaN

In [106]:
df3

      Name Branch  Gender
0     Teja    CSe    Male
1   Swathi    ECE  Female
2  Jahnavi     CS  Female
3   Chinnu     IT  Female
4      NaN  Civil     NaN

# File Reading

In [107]:
data = pd.read_csv("https://raw.githubusercontent.com/AP-Skill-Development-Corporation/PublicWorkshop_ML/main/Day3_Pandas/PublicBatch.csv")
data # github

,S.No,College Name,Program Name,Student Name,Registrationid,Phone,Email,Payment Status,Registered Date
0,1,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Mandapaka Anusha,18A91A0534,6.300452e+09,anushamandapaka77@gmail.com,success,6/19/2021
1,2,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Meneti Mounika,18A91A05F0,9.704807e+09,mounikameneti9912@gmail.com,success,6/19/2021
2,3,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Sheik Abdul Hakim,19A95A0504,9.676215e+09,hakeemabd007@gmail.com,success,6/19/2021
3,4,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Sambattula Navya Prasanna,18A91A0552,8.328650e+09,navyasambattula@gmail.com,success,6/19/2021
4,5,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Vijaya Durga Velagala,18A91A05H8,9.502362e+09,vijayadurga.velagala123@gmail.com,success,6/19/2021
5,6,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Budha Bala Atyutha Sri Sai,18A91A0510,8.500388e+09,balasai599@gmail.com,success,6/19/2021
6,7,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Karri Sirish Kumar,18A91A0529,9.491691e+09,karrisirish2000@gmail.com,success,6/19/2021
7,8,Aditya Engineering College,Machine Learning Using Python Online 2021-22,Ramavarapu Mary Ratnam,18A91A0547,7.981134e+09,rpchinnu123@gmail.com,success,6/19/2021
8,9,Aditya Engineering College,Machine Learning Using Python Online 2021-22,M.L.S.Namratha,18A91A05E7,7.013641e+09,namrathamalladi@gmail.com,success,6/21/2021
9,10,BVC Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Naga Swathi Menda,18H41F0006,9.533339e+09,nagaswathimenda97@gmail.com,success,6/25/2021
10,11,BVC Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Bonthu Naga Durga Sravani,18H41F0001,9.121442e+09,sravanibonthu31@gmail.com,success,6/26/2021
11,12,BVC Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Namana Vijaya Lakshmi Naga Durga Devi,18H41F0008,9.550399e+09,Vijayalakshminamana12@gmail.com,success,6/26/2021
12,13,BVC Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Peddireddi Yamini Srilakshmi,18H41F0010,9.153341e+09,yaminisrilakshmipeddireddy@gmail.com,success,6/26/2021
13,14,Eluru College of Engineering and Technology,Machine Learning Using Python Online 2021-22,Sravani Pulavarthi,17JD1A0493,9.346540e+09,pulavarthisravani0209@gmail.com,success,6/25/2021
14,15,G Pulla Reddy Engineering College (Autonomous),Machine Learning Using Python Online 2021-22,Kamini Sowjanya,189X5A02C9,8.247044e+09,sowjanyakamini98@gmail.com,success,6/12/2021
15,16,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Kallepalli Krishna Praneeth Sastry,18131A0374,8.500176e+09,sastrykallepalli@gmail.com,success,6/19/2021
16,17,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Bh Tarun Surya Varma,18131A04M3,7.732080e+09,tarun779911@gmail.com,success,6/23/2021
17,18,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Jahnavi Kalla,18131A0490,8.019774e+09,jahnavikalla@gmail.com,success,6/24/2021
18,19,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Pravallika Kota,18131A04A9,9.160434e+09,pravallikakota2510@gmail.com,success,6/24/2021
19,20,ISTS Women's Engineering College,Machine Learning Using Python Online 2021-22,Pedapudi Pravallika,176W1A0458,9.290074e+09,vallipedapudi458@gmail.com,success,6/22/2021
20,21,K L University,Machine Learning Using Python Online 2021-22,Grandhi Vamsi,170040262,9.182375e+09,9951672988a@gmail.com,success,6/11/2021
21,22,NBKR Institute of Sceince & Technology,Machine Learning Using Python Online 2021-22,N.Sri Giri,18KB1A0373,8.008734e+09,srigirineelam@gmail.com,success,6/24/2021
22,23,Sagi Ramakrishnam Raju Engineering College,Machine Learning Using Python Online 2021-22,Viwanth Manikanta Kankatala,18B91A0594,9.381230e+09,viswanthkankatala111@gmail.com,success,6/19/2021
23,24,Sree Vahini Institute of Science and Technology,Machine Learning Using Python Online 2021-22,Peddedula Saikumar,18MG1A0592,7.995139e+09,saikumar.7138@gmail.com,success,6/22/2021
24,25,Sree Vahini Institute of Science and Technology,Machine Learning Using Python Online 2021-22,Kaviti Siva Krishna,18MG1A0584,9.603959e+09,sivakrishnakaviti920@gmail.com,success,6/22/2021
25,26,Srinivasa Institute of Engineering & Technology,Machine Learning Using Python Online 2021-22,K Jayagowri Sruthi,176N1A0528,8.143153e+09,sruthikodi08@gmail.com,success,6/25/2021
26,27,SRM University,Machine Learning Using Python Online 2021-22,Geetika Karumudi,AP19110010123,7.995043e+09,geetikakarumudi@gmail.com,success,6/7/2021
27,28,Vignan s Institute of Engineering for Women,Machine Learning Using Python Online 2021-22,Divya Naramsetty,18NM1A0311,9.346382e+09,divyanaramsetty@gmail.com,success,6/21/2021
28,29,Vignan s LARA Institute of Technology and Science,Machine Learning Using Python Online 2021-22,Syed.Sameer,18FE1A05E1,9.640334e+09,syedsamee645@gmail.com,success,6/20/2021
29,30,MVGR College of Engineering,Machine Learning Using Python Online 2021-22,Vasireddy Teja,19335A0415,7.095737e+09,teja16052001@gmail.com,success,6/27/2021
30,31,MVGR College of Engineering,Machine Learning Using Python Online 2021-22,Thida Priyanka,18331A04F5,NaN,teedapriyanka@gmail.com,NaN,NaN
31,32,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Metta Likhitha,19131A04F2,7.569078e+09,likhithametta888@gmail.com,NaN,NaN
32,33,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Pallapothula Venkata Sreechandana,19131A04H4,8.688858e+09,19131a04h4@gvpce.ac.in,NaN,NaN
33,34,Gayatri Vidya Parishad College of Engineering,Machine Learning Using Python Online 2021-22,Marada Gowrav Srikalyan,19131A04E4,7.396917e+09,gowravsrikalyan1220@gmail.com,NaN,NaN

In [108]:
datafile = pd.read_excel("2020-07-25.xlsx")
datafile

    Unnamed: 0 Roll Number 2020-07-25
0            0  17B81A04H1          P
1            1  198A5F0019          P
2            2  17KD1A0560          P
3            3  17KH1A0455          P
4            4  1210316262          P
5            5  18P31A0555          P
6            6  18B01A0211          P
7            7    Y18IT048          P
8            8  17B81A05B2          P
9            9  169X1A04E0          P
10          10  14F41A0447          P
11          11  17W51D5505          P
12          12  18021D0501          P
13          13    Y18CS034          P
14          14    Y18IT040          P
15          15  154M1A0554          P
16          16  19025A0433          P
17          17   180030816          P
18          18  18A31A1248          P
19          19    Y18IT020          P
20          20  18AT1A0527          P
21          21  18121A02D0          P
22          22    Y18IT055          P
23          23  17NE1A0578          P
24          24    Y17CS108          P
25          25    Y18IT063          P
26          26    Y18IT043          P
27          27  178B1A0561          P
28          28  19A95F0019          P
29          29   180050012          P
30          30  166N1A0546          P
31          31   170040246          P
32          32  188W1A0460          P
33          33  14B21A04E1          P
34          34  18AT1A0559          P
35          35     N160868          P
36          36  153B1A0538          P
37          37  17751A0408          P
38          38  18G31A0439          P
39          39   180030523          P
40          40    Y18IT029          P
41          41  18A81A05M5          P
42          42  18A51A1206          P
43          43  18B91A0209          P
44          44  1210416462          P
45          45     R151263          P
46          46     Y18CS80          P
47          47  17F21A0348          P
48          48  10G11A0209          P
49          49  19B95A0512          P
50          50    Y18IT025          P
51          51    Y18IT092          P
52          52    Y18CS166          P
53          53     R141465          P
54          54  17JN1A0495          P
55          55   170031480          P
56          56  2020239167          P

In [109]:
data = pd.read_csv("iris.csv")
data # local repo

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
0,0,5.1,3.5,1.4,0.2,0
1,1,4.9,3.0,1.4,0.2,0
2,2,4.7,3.2,1.3,0.2,0
3,3,4.6,3.1,1.5,0.2,0
4,4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...,...
145,145,6.7,3.0,5.2,2.3,2
146,146,6.3,2.5,5.0,1.9,2
147,147,6.5,3.0,5.2,2.0,2
148,148,6.2,3.4,5.4,2.3,2
149,149,5.9,3.0,5.1,1.8,2